Revit 2026 API

# FilteredElementCollectorOfCategory Method

---

Applies an ElementCategoryFilter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector OfCategory(
	BuiltInCategory category
)
```
```vb
Public Function OfCategory (
	category As BuiltInCategory
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ OfCategory(
	BuiltInCategory category
)
```
```fsharp
member OfCategory :
        category : BuiltInCategory -> FilteredElementCollector
```

#### Parameters

category BuiltInCategory
     The category.

#### Return Value

FilteredElementCollector This collector.

Only elements of this category id will pass the collector.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace